In [88]:
import pandas as pd
import numpy as np
import datetime
import sqlalchemy
from sqlalchemy import create_engine, Inspector, text
import mysql.connector
from dateutil.relativedelta import relativedelta
from datetime import datetime

In [89]:
def age(birthdate):
    # Ensure birthdate is a datetime object
    birthdate = pd.to_datetime(birthdate)
    ref_date = datetime(2016, 2, 28)
    age = relativedelta(ref_date, birthdate).years
    return age

def days(birthdate):
    # Ensure birthdate is a datetime object
    birthdate = pd.to_datetime(birthdate)
    ref_date = datetime(2016, 2, 28)
    age = relativedelta(ref_date, birthdate).days
    return age

# Define the decade calculation function
def decade(age):
    start_year = (age // 10) * 10
    end_year = start_year + 9
    return (f'{start_year}-{end_year}')

def billstatus(value):
    if pd.isna(value):
        return "Unbilled"
    elif value > 0:
        return "Billed"
    else:
        return "Unbilled"

In [90]:
alter_table_query = """
ALTER TABLE cus
MODIFY COLUMN Birthday DATE;
"""

# Execute the ALTER TABLE query
with engine.connect() as conn:
    conn.execute(text(alter_table_query))

print("Table schema updated successfully.")

NameError: name 'engine' is not defined

In [ ]:
engine = create_engine("mysql+mysqlconnector://root:1234@localhost:3306/ele")

In [ ]:
cus = pd.read_csv("Customers.csv")
exch = pd.read_csv("Exchange_Rates.csv")
sale = pd.read_csv("Sales.csv")
pds = pd.read_csv("Products.csv")
sto = pd.read_csv("Stores.csv")

In [ ]:
cus.head()

,CustomerKey,Gender,Name,City,State_Code,State,Zip_Code,Country,Continent,Birthday,cus_age,Age_Group
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03,76,70-79
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,36,30-39
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26,68,60-69
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17,58,50-59
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19,50,50-59

In [ ]:
cus["Birthday"]= cus["Birthday"].str.replace("/","-")
cus["Birthday"]= pd.to_datetime(cus["Birthday"],format = "%m-%d-%Y")

In [ ]:
cus["cus_age"] = cus["Birthday"].apply(age)
cus["Age_Group"] = cus["cus_age"].apply(decade)

In [ ]:
exch.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Ex_Date   11215 non-null  object
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

In [ ]:
exch["Ex_Date"]= exch["Ex_Date"].str.replace("/","-")
exch["Ex_Date"]= pd.to_datetime(exch["Ex_Date"],format = "%m-%d-%Y")

In [ ]:
exch.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Ex_Date   11215 non-null  datetime64[ns]
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

In [ ]:
pds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product_Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit_Cost_USD   2517 non-null   object
 5   Unit_Price_USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [ ]:
pds["Unit_Cost_USD"]= pds["Unit_Cost_USD"].str.replace("[$/,]","",regex=True)
pds["Unit_Price_USD"]= pds["Unit_Price_USD"].str.replace("[$/,]","",regex=True)

pds["Unit_Cost_USD"]= pds["Unit_Cost_USD"].apply(lambda i : float(i))
pds["Unit_Price_USD"]= pds["Unit_Price_USD"].apply(lambda i : float(i))

In [ ]:
pds.head()

,ProductKey,Product_Name,Brand,Color,Unit_Cost_USD,Unit_Price_USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio

In [ ]:
sale

,Order_Number,Line_Item,Order_Date,Delivery_Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency_Code
0,366000,1,01-01-2016,NaN,265598,10,1304,1,CAD
1,366001,1,01-01-2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,01-01-2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,01-01-2016,01-12-2016,266019,0,1106,7,CAD
4,366002,2,01-01-2016,01-12-2016,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2/20/2021,NaN,1216913,43,632,3,USD
62880,2243031,1,2/20/2021,2/24/2021,511229,0,98,4,EUR
62881,2243032,1,2/20/2021,2/23/2021,331277,0,1613,2,CAD
62882,2243032,2,2/20/2021,2/23/2021,331277,0,1717,2,CAD
62883,2243032,3,2/20/2021,2/23/2021,331277,0,464,7,CAD

In [ ]:
sale.drop(columns="Ex_Date", inplace=True)

In [ ]:
sale.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_Number   62884 non-null  int64
 1   Line_Item      62884 non-null  int64
 2   Order_Date     62884 non-null  object
 3   Delivery_Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency_Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

In [ ]:
sale["Order_Date"]= sale["Order_Date"].str.replace("/","-")
sale["Delivery_Date"] = sale["Delivery_Date"].str.replace("/", "-")

sale["Order_Date"]= pd.to_datetime(sale["Order_Date"],format = "%m-%d-%Y")
sale["Delivery_Date"]= pd.to_datetime(sale["Delivery_Date"],format = "%m-%d-%Y")

In [ ]:
sale = pd.merge(sale, exch, left_on=['Order_Date', 'Currency_Code'], right_on=['Ex_Date', 'Currency'], how='left')

In [ ]:
PDS_filtered = pds[['ProductKey', 'Unit_Cost_USD', 'Unit_Price_USD']]
sale =pd.merge(sale, PDS_filtered, left_on=['ProductKey'], right_on=['ProductKey'], how='left')

In [ ]:
sale["cost_price_USD"] = (sale['Quantity']*sale['Unit_Cost_USD']*sale['Exchange']).round(2)
sale["sale_price_USD"] = (sale['Quantity']*sale['Unit_Price_USD']*sale['Exchange']).round(2)
sale["profit(%)"] = ((sale["sale_price_USD"] - sale["cost_price_USD"])*100 / sale["sale_price_USD"]).round(2)

In [ ]:
result = sale.groupby(["CustomerKey", "Order_Number"])["sale_price_USD"].sum().reset_index()

In [ ]:
result = result.groupby("CustomerKey").agg(order_count=("Order_Number", "count"),total_sales=("sale_price_USD", "sum")).reset_index()

In [ ]:
cus =pd.merge(cus, result, left_on="CustomerKey", right_on="CustomerKey", how='left')

In [ ]:
cus["BillStatus"] = cus["total_sales"].apply(billstatus)

In [ ]:
cus.head()

,CustomerKey,Gender,Name,City,State_Code,State,Zip_Code,Country,Continent,Birthday,cus_age,Age_Group,order_count,total_sales,BillStatus
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03,76,70-79,1.0,863.550400,Billed
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,36,30-39,3.0,7686.915227,Billed
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26,68,60-69,2.0,1326.770308,Billed
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17,58,50-59,NaN,NaN,Unbilled
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19,50,50-59,1.0,1435.722633,Billed

In [ ]:
sale.head(3)

,Order_Number,Line_Item,Order_Date,Delivery_Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency_Code,Exchange,Unit_Cost_USD,Unit_Price_USD,cost_price_USD,sale_price_USD,profit(%)
0,366000,1,2016-01-01,NaT,265598,10,1304,1,CAD,1.3884,31.27,68.00,43.42,94.41,54.01
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD,1.0000,141.47,427.00,282.94,854.00,66.87
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD,1.0000,220.64,665.94,220.64,665.94,66.87

In [ ]:
sto

    StoreKey        Country                         State      sq  Open_Date
0          1      Australia  Australian Capital Territory   595.0 2008-01-01
1          2      Australia            Northern Territory   665.0 2008-01-12
2          3      Australia               South Australia  2000.0 2012-01-07
3          4      Australia                      Tasmania  2000.0 2010-01-01
4          5      Australia                      Victoria  2000.0 2015-12-09
..       ...            ...                           ...     ...        ...
62        63  United States                          Utah  2000.0 2008-03-06
63        64  United States                 Washington DC  1330.0 2010-01-01
64        65  United States                 West Virginia  1785.0 2012-01-01
65        66  United States                       Wyoming   840.0 2014-01-01
66         0         Online                        Online     NaN 2010-01-01

[67 rows x 5 columns]

In [ ]:
sto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StoreKey   67 non-null     int64
 1   Country    67 non-null     object
 2   State      67 non-null     object
 3   sq         66 non-null     float64
 4   Open_Date  67 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [ ]:
sto["Open_Date"]= sto["Open_Date"].str.replace("/","-")
sto["Open_Date"]= pd.to_datetime(sto["Open_Date"],format = "%m-%d-%Y")

In [ ]:
pds.head()

,ProductKey,Product_Name,Brand,Color,Unit_Cost_USD,Unit_Price_USD,SubcategoryKey,Subcategory,CategoryKey,Category,cost_price_USD,sale_price_USD,Quantity,profit
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio,417.540612,819.313074,65.0,49.04
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio,497.007754,975.246333,77.0,49.04
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio,570.238820,1118.901036,80.0,49.04
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio,781.771100,1532.982057,74.0,49.00
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio,544.658400,1068.025608,49.0,49.00

In [ ]:
sale.head(1)

,Order_Number,Line_Item,Order_Date,Delivery_Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency_Code,Exchange,Unit_Cost_USD,Unit_Price_USD,cost_price_USD,sale_price_USD,profit(%)
0,366000,1,2016-01-01,NaT,265598,10,1304,1,CAD,1.3884,31.27,68.0,43.42,94.41,54.01

In [ ]:
result = sale.groupby("ProductKey")["cost_price_USD"].sum().reset_index()

In [ ]:
pds =pd.merge(pds, result, left_on="ProductKey", right_on="ProductKey", how='left')

In [ ]:
result = sale.groupby("ProductKey")["sale_price_USD"].sum().reset_index()

In [ ]:
pds =pd.merge(pds, result, left_on="ProductKey", right_on="ProductKey", how='left')

In [ ]:
result = sale.groupby("ProductKey")["Quantity"].sum().reset_index()
pds =pd.merge(pds, result, left_on="ProductKey", right_on="ProductKey", how='left')

In [ ]:
pds["profit"] = ((pds["sale_price_USD"]-pds["cost_price_USD"])*100/pds["sale_price_USD"]).round(2)

In [ ]:
pds.head(3)

,ProductKey,Product_Name,Brand,Color,Unit_Cost_USD,Unit_Price_USD,SubcategoryKey,Subcategory,CategoryKey,Category,cost_price_USD,sale_price_USD,Quantity,profit
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio,417.54,819.31,65.0,49.04
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio,497.01,975.25,77.0,49.04
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio,570.24,1118.90,80.0,49.04

In [ ]:
result = cus[["CustomerKey","Gender","City","State","City","Zip_Code","Country","Continent","Birthday"]]
sale = pd.merge(sale, result, left_on="CustomerKey", right_on="CustomerKey", how='left')

In [ ]:
sale["age"] = round((sale["Order_Date"] - sale["Birthday"]).dt.days / 365.25, 0)
sale["age_group"]= sale["age"].apply(decade)

In [126]:
sale.head(3)

,Order_Number,Line_Item,Order_Date,Delivery_Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency_Code,Exchange,...,profit(%),Gender,City,State,City,Zip_Code,Country,Continent,age,age_group
0,366000,1,2016-01-01,NaT,265598,10,1304,1,CAD,1.3884,...,54.01,Male,London,Ontario,London,N5W 5K6,Canada,North America,45.0,40.0-49.0
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD,1.0000,...,66.87,Male,Auberry,California,Auberry,93602,United States,North America,20.0,20.0-29.0
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD,1.0000,...,66.87,Male,Auberry,California,Auberry,93602,United States,North America,20.0,20.0-29.0

In [93]:
cus.head(2)

,CustomerKey,Gender,Name,City,State_Code,State,Zip_Code,Country,Continent,Birthday,cus_age,Age_Group,order_count,total_sales,BillStatus
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03,76,70-79,1.0,863.55,Billed
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,36,30-39,3.0,7686.92,Billed

In [127]:
result = sale.groupby("StoreKey")["Quantity"].sum().reset_index()
sto =pd.merge(sto, result, left_on="StoreKey", right_on="StoreKey", how='left')

In [132]:
sale.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 24 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order_Number    62884 non-null  int64
 1   Line_Item       62884 non-null  int64
 2   Order_Date      62884 non-null  datetime64[ns]
 3   Delivery_Date   13165 non-null  datetime64[ns]
 4   CustomerKey     62884 non-null  int64
 5   StoreKey        62884 non-null  int64
 6   ProductKey      62884 non-null  int64
 7   Quantity        62884 non-null  int64
 8   Currency_Code   62884 non-null  object
 9   Exchange        62884 non-null  float64
 10  Unit_Cost_USD   62884 non-null  float64
 11  Unit_Price_USD  62884 non-null  float64
 12  cost_price_USD  62884 non-null  float64
 13  sale_price_USD  62884 non-null  float64
 14  profit(%)       62884 non-null  float64
 15  Gender          62884 non-null  object
 16  City            62884 non-null  object
 17  State           62884 non-null  object
 18  City            62884 non-null  object
 19  Zip_Code        62884 non-null  object
 20  Country         62884 non-null  object
 21  Continent       62884 non-null  object
 22  age             62884 non-null  float64
 23  age_group       62884 non-null  object
dtypes: datetime64[ns](2), float64(7), int64(6), object(9)
memory usage: 11.5+ MB

In [133]:
result = sale.groupby("StoreKey")["cost_price_USD"].sum().reset_index()
sto =pd.merge(sto, result, left_on="StoreKey", right_on="StoreKey", how='left')

In [134]:
result = sale.groupby("StoreKey")["sale_price_USD"].sum().reset_index()
sto =pd.merge(sto, result, left_on="StoreKey", right_on="StoreKey", how='left')

In [136]:
sto["profit"] = ((sto["sale_price_USD"]-sto["cost_price_USD"])*100/sto["sale_price_USD"]).round(2)

In [138]:
sto["billstatus"] = sto["sale_price_USD"].apply(billstatus)

In [144]:
sto

,StoreKey,Country,State,sq,Open_Date,Quantity,cost_price_USD,sale_price_USD,profit,billstatus,days,per_day_sales
0,1,Australia,Australian Capital Territory,595.0,2008-01-01,871.0,142927.92,342086.52,58.22,Billed,2980,114.79
1,2,Australia,Northern Territory,665.0,2008-01-12,61.0,7772.16,20843.53,62.71,Billed,2969,7.02
2,3,Australia,South Australia,2000.0,2012-01-07,NaN,NaN,NaN,NaN,Unbilled,1513,NaN
3,4,Australia,Tasmania,2000.0,2010-01-01,1286.0,244739.29,615054.84,60.21,Billed,2249,273.48
4,5,Australia,Victoria,2000.0,2015-12-09,2944.0,487047.15,1197946.77,59.34,Billed,81,14789.47
...,...,...,...,...,...,...,...,...,...,...,...,...
62,63,United States,Utah,2000.0,2008-03-06,2875.0,335632.05,819931.04,59.07,Billed,2915,281.28
63,64,United States,Washington DC,1330.0,2010-01-01,4289.0,514066.99,1259350.98,59.18,Billed,2249,559.96
64,65,United States,West Virginia,1785.0,2012-01-01,4524.0,513693.60,1225040.38,58.07,Billed,1519,806.48
65,66,United States,Wyoming,840.0,2014-01-01,3986.0,497774.17,1220964.38,59.23,Billed,788,1549.45
66,0,Online,Online,NaN,2010-01-01,41311.0,4744171.99,11431369.36,58.50,Billed,2249,5082.87

In [140]:
def days(given_date):
    # Define a static reference date
    reference_date = datetime(2016, 2, 28)
    
    # Calculate the number of days between the given date and the reference date
    number_of_days = (reference_date - given_date).days
    
    return number_of_days

# Assuming 'sto' is your DataFrame and 'Open_Date' column is in datetime format
sto["days"] = sto["Open_Date"].apply(days)

In [148]:
sale['Order_Month'] = sale['Order_Date'].dt.strftime('%B')
sale['Order_Year'] = sto_year['Order_Date'].dt.year

In [149]:
def week_of_month(date):
    # Get the week number of the date in the year
    week = date.isocalendar()[1]
    
    # Get the week number of the first day of the month
    first_day_of_month = date.replace(day=1)
    first_week = first_day_of_month.isocalendar()[1]
    
    # Calculate the week of the month
    week_of_month = week - first_week + 1
    return week_of_month

# Apply the function to the DataFrame
sale['Week_of_Month'] = sale['Order_Date'].apply(week_of_month)

In [157]:
pds.rename(columns={
    'cost_price_USD': 'purchase',
    'sale_price_USD': 'sales',
}, inplace=True)

In [170]:
sto.rename(columns={
    'customer_country':'Country',
    'customer_state':'State'
}, inplace=True)

In [176]:
sale.rename(columns={
    'Country':'customer_country',
    'State':'customer_state'
}, inplace=True)

In [171]:
result = sto[["StoreKey","Country","State"]]

In [173]:
result.rename(columns={
    'Country':'store_country',
    'State':'store_state'
}, inplace=True)

C:\Users\Gopinath M\AppData\Local\Temp\ipykernel_5444\3860713270.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  result.rename(columns={

In [159]:
sto.rename(columns={
    'cost_price_USD': 'purchase',
    'sale_price_USD': 'sales',
}, inplace=True)

In [174]:
sale =pd.merge(sale, result, left_on="StoreKey", right_on="StoreKey", how='left')

In [178]:
cus.head(1)

,CustomerKey,Gender,Name,City,State_Code,State,Zip_Code,Country,Continent,Birthday,cus_age,Age_Group,order_count,total_sales,BillStatus
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03,76,70-79,1.0,863.55,Billed

In [188]:
sale[sale["CustomerKey"] ==301 ]

,Order_Number,Line_Item,Order_Date,Delivery_Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency_Code,Exchange,...,Zip_Code,customer_country,Continent,age,age_group,Order_Month,Order_Year,Week_of_Month,store_country,store_state
46415,1776007,1,2019-11-11,2019-11-13,301,0,53,2,AUD,1.4587,...,5523,Australia,Australia,80.0,80.0-89.0,November,2019,3,Online,Online

In [179]:
sale.head(1)

,Order_Number,Line_Item,Order_Date,Delivery_Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency_Code,Exchange,...,Zip_Code,customer_country,Continent,age,age_group,Order_Month,Order_Year,Week_of_Month,store_country,store_state
0,366000,1,2016-01-01,NaT,265598,10,1304,1,CAD,1.3884,...,N5W 5K6,Canada,North America,45.0,40.0-49.0,January,2016,1,Canada,Nunavut

In [180]:
pds.head(1)

,ProductKey,Product_Name,Brand,Color,Unit_Cost_USD,Unit_Price_USD,SubcategoryKey,Subcategory,CategoryKey,Category,purchase,sales,Quantity,profit
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio,417.54,819.31,65.0,49.04

In [181]:
sto.head(1)

,StoreKey,Country,State,sq,Open_Date,Quantity,purchase,sales,profit,billstatus,days,per_day_sales
0,1,Australia,Australian Capital Territory,595.0,2008-01-01,871.0,142927.92,342086.52,58.22,Billed,2980,114.79

In [ ]:
alter_table_query = """
ALTER TABLE cus
MODIFY COLUMN Birthday DATE;
"""

# Execute the ALTER TABLE query
with engine.connect() as conn:
    conn.execute(text(alter_table_query))

print("Table schema updated successfully.")

In [182]:
cus.to_csv("cus.csv")
exch.to_csv("exch.csv")
sale.to_csv("sale.csv")
pds.to_csv("pds.csv")
sto.to_csv("sto.csv")

In [183]:
engine = sqlalchemy.create_engine("mysql+mysqlconnector://admin:gopi1234@gopids.c5ic8ayqm05z.ap-south-1.rds.amazonaws.com:3306")

In [184]:
with engine.connect() as conn:
    conn.execute(text("CREATE DATABASE IF NOT EXISTS ele"))

In [185]:
engine = sqlalchemy.create_engine("mysql+mysqlconnector://admin:gopi1234@gopids.c5ic8ayqm05z.ap-south-1.rds.amazonaws.com:3306/ele")

In [186]:
cus.to_sql("cus.csv",engine)
exch.to_sql("exch.csv",engine)
sale.to_sql("sale.csv",engine)
pds.to_sql("pds.csv",engine)
sto.to_sql("sto.csv",engine)

DuplicateColumnError: A column with name 'City' is already present in table 'sale.csv'.

In [ ]:
result = cus[["CustomerKey","city"]]

In [190]:
sale.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 27 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order_Number      62884 non-null  int64
 1   Line_Item         62884 non-null  int64
 2   Order_Date        62884 non-null  datetime64[ns]
 3   Delivery_Date     13165 non-null  datetime64[ns]
 4   CustomerKey       62884 non-null  int64
 5   StoreKey          62884 non-null  int64
 6   ProductKey        62884 non-null  int64
 7   Quantity          62884 non-null  int64
 8   Currency_Code     62884 non-null  object
 9   Exchange          62884 non-null  float64
 10  Unit_Cost_USD     62884 non-null  float64
 11  Unit_Price_USD    62884 non-null  float64
 12  cost_price_USD    62884 non-null  float64
 13  sale_price_USD    62884 non-null  float64
 14  profit(%)         62884 non-null  float64
 15  Gender            62884 non-null  object
 16  customer_state    62884 non-null  object
 17  Zip_Code          62884 non-null  object
 18  customer_country  62884 non-null  object
 19  Continent         62884 non-null  object
 20  age               62884 non-null  float64
 21  age_group         62884 non-null  object
 22  Order_Month       62884 non-null  object
 23  Order_Year        62884 non-null  int32
 24  Week_of_Month     62884 non-null  int64
 25  store_country     62884 non-null  object
 26  store_state       62884 non-null  object
dtypes: datetime64[ns](2), float64(7), int32(1), int64(7), object(10)
memory usage: 12.7+ MB

In [189]:
sale = sale.drop(sale.columns[16], axis=1)